# Практическая работа по уроку "Динамическая типизация"
# Цель: Написать программу на языке Python, используя Pycharm, для демонстрации динамической типизации.
# В проекте, где вы решаете домашние задания, создайте модуль 'module_1_3.py' и напишите весь код в нём.
# 2. Создайте переменные разных типов данных:
#   - Создайте переменную name и присвойте ей значение вашего имени (строка).
from operator import truediv

name = 'Andrei'
#   - Выведите значение переменной name на экран.
print('Name: ', name)

#   - Создайте переменную age и присвойте ей значение вашего возраста (целое число)
age = 54

#   - Выведите значение переменной age на экран.
print('Age: ', age)

#   - Перезапишите в age текущее значение переменной age + новое.
age = age + 1

#   - Выведите измененное значение переменной age на экран.
print('New Age: ', age)

#   - Создайте переменную is_student и присвойте ей значение True (логическое значение).
is_student = True

#   - Выведите значение переменной is_student на экран.
print('Is Student: ', is_student)